Repository: islomov/zebra-qr-code-scanner
Catalog: ZebraCodeScanner/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, hi, id, it, ja, ko, ms, nb, nl, pl, pt_br, ru, sv, th, tr, uk, uz, vi, zh_hans, zh_hant

# barcode_form.button.generate
source: Generate Barcode
ar: إنشاء باركود
da: Generer stregkode
de: Barcode generieren
es: Generar código de barras
fi: Luo viivakoodi
fr: Générer un code-barres
hi: बारकोड बनाएं
id: Buat Barcode
it: Genera codice a barre
ja: バーコードを生成
ko: 바코드 생성
ms: Jana Kod Bar
nb: Generer strekkode
nl: Genereer streepjescode
pl: Wygeneruj kod kreskowy
pt_br: Gerar código de barras
ru: Сгенерировать штрих-код
sv: Generera streckkod
th: สร้างบาร์โค้ด
tr: Barkod Oluştur
uk: Згенерувати штрих-код
uz: Shtrix-kod yaratish
vi: Tạo mã vạch
zh_hans: 生成条形码
zh_hant: 產生條碼

# barcode_form.footer.aztec
source: Aztec codes support text, numbers, and special characters
ar: رموز Aztec تدعم النصوص والأرقام والأحرف الخاصة
da: Aztec-koder understøtter tekst, tal og specialtegn
de: Aztec-Codes unterstützen Text, Zahlen und Sonderzeichen
es: Los códigos Aztec admiten texto, números y caracteres especiales
fi: Aztec-koodit tukevat tekstiä, numeroita ja erikoismerkkejä
fr: Les codes Aztec prennent en charge le texte, les chiffres et les caractères spéciaux
hi: Aztec कोड टेक्स्ट, संख्याएं और विशेष अक्षर सपोर्ट करते हैं
id: Kode Aztec mendukung teks, angka, dan karakter khusus
it: I codici Aztec supportano testo, numeri e caratteri speciali
ja: Aztecコードはテキスト、数字、特殊文字に対応しています
ko: Aztec 코드는 텍스트, 숫자 및 특수 문자를 지원합니다
ms: Kod Aztec menyokong teks, nombor dan aksara khas
nb: Aztec-koder støtter tekst, tall og spesialtegn
nl: Aztec-codes ondersteunen tekst, cijfers en speciale tekens
pl: Kody Aztec obsługują tekst, cyfry i znaki specjalne
pt_br: Os códigos Aztec suportam texto, números e caracteres especiais
ru: Коды Aztec поддерживают текст, цифры и специальные символы
sv: Aztec-koder stöder text, siffror och specialtecken
th: Aztec โค้ดรองรับข้อความ ตัวเลข และอักขระพิเศษ
tr: Aztec kodları metin, sayı ve özel karakterleri destekler
uk: Коди Aztec підтримують текст, цифри та спеціальні символи
uz: Aztec kodlari matn, raqamlar va maxsus belgilarni qo'llab-quvvatlaydi
vi: Mã Aztec hỗ trợ văn bản, số và ký tự đặc biệt
zh_hans: Aztec码支持文本、数字和特殊字符
zh_hant: Aztec碼支援文字、數字和特殊字元

# barcode_form.footer.code39
source: Code 39 supports uppercase letters, numbers, and - . $ / + % space
ar: Code 39 يدعم الأحرف الكبيرة والأرقام و - . $ / + % مسافة
da: Code 39 understøtter store bogstaver, tal og - . $ / + % mellemrum
de: Code 39 unterstützt Großbuchstaben, Zahlen und - . $ / + % Leerzeichen
es: Code 39 admite letras mayúsculas, números y - . $ / + % espacio
fi: Code 39 tukee isoja kirjaimia, numeroita ja - . $ / + % välilyöntiä
fr: Code 39 prend en charge les majuscules, les chiffres et - . $ / + % espace
hi: Code 39 बड़े अक्षर, संख्याएं और - . $ / + % स्पेस सपोर्ट करता है
id: Code 39 mendukung huruf kapital, angka, dan - . $ / + % spasi
it: Code 39 supporta lettere maiuscole, numeri e - . $ / + % spazio
ja: Code 39は大文字、数字、- . $ / + % スペースに対応しています
ko: Code 39는 대문자, 숫자 및 - . $ / + % 공백을 지원합니다
ms: Code 39 menyokong huruf besar, nombor dan - . $ / + % ruang
nb: Code 39 støtter store bokstaver, tall og - . $ / + % mellomrom
nl: Code 39 ondersteunt hoofdletters, cijfers en - . $ / + % spatie
pl: Code 39 obsługuje wielkie litery, cyfry i - . $ / + % spację
pt_br: Code 39 suporta letras maiúsculas, números e - . $ / + % espaço
ru: Code 39 поддерживает заглавные буквы, цифры и - . $ / + % пробел
sv: Code 39 stöder versaler, siffror och - . $ / + % mellanslag
th: Code 39 รองรับตัวอักษรพิมพ์ใหญ่ ตัวเลข และ - . $ / + % เว้นวรรค
tr: Code 39 büyük harfleri, sayıları ve - . $ / + % boşluk karakterlerini destekler
uk: Code 39 підтримує великі літери, цифри та - . $ / + % пробіл
uz: Code 39 katta harflar, raqamlar va - . $ / + % bo'sh joyni qo'llab-quvvatlaydi
vi: Code 39 hỗ trợ chữ in hoa, số và - . $ / + % khoảng trắng
zh_hans: Code 39支持大写字母、数字以及 - . $ / + % 空格
zh_hant: Code 39支援大寫字母、數字以及 - . $ / + % 空格

# barcode_form.footer.code93
source: Code 93 supports uppercase letters, numbers, and - . $ / + % space
ar: Code 93 يدعم الأحرف الكبيرة والأرقام و - . $ / + % مسافة
da: Code 93 understøtter store bogstaver, tal og - . $ / + % mellemrum
de: Code 93 unterstützt Großbuchstaben, Zahlen und - . $ / + % Leerzeichen
es: Code 93 admite letras mayúsculas, números y - . $ / + % espacio
fi: Code 93 tukee isoja kirjaimia, numeroita ja - . $ / + % välilyöntiä
fr: Code 93 prend en charge les majuscules, les chiffres et - . $ / + % espace
hi: Code 93 बड़े अक्षर, संख्याएं और - . $ / + % स्पेस सपोर्ट करता है
id: Code 93 mendukung huruf kapital, angka, dan - . $ / + % spasi
it: Code 93 supporta lettere maiuscole, numeri e - . $ / + % spazio
ja: Code 93は大文字、数字、- . $ / + % スペースに対応しています
ko: Code 93은 대문자, 숫자 및 - . $ / + % 공백을 지원합니다
ms: Code 93 menyokong huruf besar, nombor dan - . $ / + % ruang
nb: Code 93 støtter store bokstaver, tall og - . $ / + % mellomrom
nl: Code 93 ondersteunt hoofdletters, cijfers en - . $ / + % spatie
pl: Code 93 obsługuje wielkie litery, cyfry i - . $ / + % spację
pt_br: Code 93 suporta letras maiúsculas, números e - . $ / + % espaço
ru: Code 93 поддерживает заглавные буквы, цифры и - . $ / + % пробел
sv: Code 93 stöder versaler, siffror och - . $ / + % mellanslag
th: Code 93 รองรับตัวอักษรพิมพ์ใหญ่ ตัวเลข และ - . $ / + % เว้นวรรค
tr: Code 93 büyük harfleri, sayıları ve - . $ / + % boşluk karakterlerini destekler
uk: Code 93 підтримує великі літери, цифри та - . $ / + % пробіл
uz: Code 93 katta harflar, raqamlar va - . $ / + % bo'sh joyni qo'llab-quvvatlaydi
vi: Code 93 hỗ trợ chữ in hoa, số và - . $ / + % khoảng trắng
zh_hans: Code 93支持大写字母、数字以及 - . $ / + % 空格
zh_hant: Code 93支援大寫字母、數字以及 - . $ / + % 空格

# barcode_form.footer.code128
source: Code 128 supports letters, numbers, and special characters
ar: Code 128 يدعم الأحرف والأرقام والأحرف الخاصة
da: Code 128 understøtter bogstaver, tal og specialtegn
de: Code 128 unterstützt Buchstaben, Zahlen und Sonderzeichen
es: Code 128 admite letras, números y caracteres especiales
fi: Code 128 tukee kirjaimia, numeroita ja erikoismerkkejä
fr: Code 128 prend en charge les lettres, les chiffres et les caractères spéciaux
hi: Code 128 अक्षर, संख्याएं और विशेष अक्षर सपोर्ट करता है
id: Code 128 mendukung huruf, angka, dan karakter khusus
it: Code 128 supporta lettere, numeri e caratteri speciali
ja: Code 128は英字、数字、特殊文字に対応しています
ko: Code 128은 영문자, 숫자 및 특수 문자를 지원합니다
ms: Code 128 menyokong huruf, nombor dan aksara khas
nb: Code 128 støtter bokstaver, tall og spesialtegn
nl: Code 128 ondersteunt letters, cijfers en speciale tekens
pl: Code 128 obsługuje litery, cyfry i znaki specjalne
pt_br: Code 128 suporta letras, números e caracteres especiais
ru: Code 128 поддерживает буквы, цифры и специальные символы
sv: Code 128 stöder bokstäver, siffror och specialtecken
th: Code 128 รองรับตัวอักษร ตัวเลข และอักขระพิเศษ
tr: Code 128 harfleri, sayıları ve özel karakterleri destekler
uk: Code 128 підтримує літери, цифри та спеціальні символи
uz: Code 128 harflar, raqamlar va maxsus belgilarni qo'llab-quvvatlaydi
vi: Code 128 hỗ trợ chữ cái, số và ký tự đặc biệt
zh_hans: Code 128支持字母、数字和特殊字符
zh_hant: Code 128支援字母、數字和特殊字元

# barcode_form.footer.ean8
source: Enter 7 or 8 digits. Check digit will be calculated automatically
ar: أدخل 7 أو 8 أرقام. سيتم حساب رقم التحقق تلقائياً
da: Indtast 7 eller 8 cifre. Kontrolcifferet beregnes automatisk
de: Gib 7 oder 8 Ziffern ein. Die Prüfziffer wird automatisch berechnet
es: Ingresa 7 u 8 dígitos. El dígito de control se calculará automáticamente
fi: Syötä 7 tai 8 numeroa. Tarkistusnumero lasketaan automaattisesti
fr: Saisissez 7 ou 8 chiffres. Le chiffre de contrôle sera calculé automatiquement
hi: 7 या 8 अंक दर्ज करें। चेक डिजिट स्वचालित रूप से गणना होगी
id: Masukkan 7 atau 8 digit. Digit cek akan dihitung otomatis
it: Inserisci 7 o 8 cifre. La cifra di controllo verrà calcolata automaticamente
ja: 7桁または8桁を入力してください。チェックディジットは自動計算されます
ko: 7자리 또는 8자리를 입력하세요. 체크 디지트가 자동으로 계산됩니다
ms: Masukkan 7 atau 8 digit. Digit semak akan dikira secara automatik
nb: Skriv inn 7 eller 8 sifre. Kontrollsifferet beregnes automatisk
nl: Voer 7 of 8 cijfers in. Het controlecijfer wordt automatisch berekend
pl: Wpisz 7 lub 8 cyfr. Cyfra kontrolna zostanie obliczona automatycznie
pt_br: Digite 7 ou 8 dígitos. O dígito verificador será calculado automaticamente
ru: Введите 7 или 8 цифр. Контрольная цифра будет рассчитана автоматически
sv: Ange 7 eller 8 siffror. Kontrollsiffran beräknas automatiskt
th: กรอก 7 หรือ 8 หลัก ตัวเลขตรวจสอบจะคำนวณโดยอัตโนมัติ
tr: 7 veya 8 rakam girin. Kontrol basamağı otomatik hesaplanır
uk: Введіть 7 або 8 цифр. Контрольна цифра буде розрахована автоматично
uz: 7 yoki 8 ta raqam kiriting. Tekshiruv raqami avtomatik hisoblanadi
vi: Nhập 7 hoặc 8 chữ số. Số kiểm tra sẽ được tính tự động
zh_hans: 请输入7位或8位数字。校验位将自动计算
zh_hant: 請輸入7位或8位數字。檢查碼將自動計算

# barcode_form.footer.ean13
source: Enter 12 or 13 digits. Check digit will be calculated automatically
ar: أدخل 12 أو 13 رقماً. سيتم حساب رقم التحقق تلقائياً
da: Indtast 12 eller 13 cifre. Kontrolcifferet beregnes automatisk
de: Gib 12 oder 13 Ziffern ein. Die Prüfziffer wird automatisch berechnet
es: Ingresa 12 o 13 dígitos. El dígito de control se calculará automáticamente
fi: Syötä 12 tai 13 numeroa. Tarkistusnumero lasketaan automaattisesti
fr: Saisissez 12 ou 13 chiffres. Le chiffre de contrôle sera calculé automatiquement
hi: 12 या 13 अंक दर्ज करें। चेक डिजिट स्वचालित रूप से गणना होगी
id: Masukkan 12 atau 13 digit. Digit cek akan dihitung otomatis
it: Inserisci 12 o 13 cifre. La cifra di controllo verrà calcolata automaticamente
ja: 12桁または13桁を入力してください。チェックディジットは自動計算されます
ko: 12자리 또는 13자리를 입력하세요. 체크 디지트가 자동으로 계산됩니다
ms: Masukkan 12 atau 13 digit. Digit semak akan dikira secara automatik
nb: Skriv inn 12 eller 13 sifre. Kontrollsifferet beregnes automatisk
nl: Voer 12 of 13 cijfers in. Het controlecijfer wordt automatisch berekend
pl: Wpisz 12 lub 13 cyfr. Cyfra kontrolna zostanie obliczona automatycznie
pt_br: Digite 12 ou 13 dígitos. O dígito verificador será calculado automaticamente
ru: Введите 12 или 13 цифр. Контрольная цифра будет рассчитана автоматически
sv: Ange 12 eller 13 siffror. Kontrollsiffran beräknas automatiskt
th: กรอก 12 หรือ 13 หลัก ตัวเลขตรวจสอบจะคำนวณโดยอัตโนมัติ
tr: 12 veya 13 rakam girin. Kontrol basamağı otomatik hesaplanır
uk: Введіть 12 або 13 цифр. Контрольна цифра буде розрахована автоматично
uz: 12 yoki 13 ta raqam kiriting. Tekshiruv raqami avtomatik hisoblanadi
vi: Nhập 12 hoặc 13 chữ số. Số kiểm tra sẽ được tính tự động
zh_hans: 请输入12位或13位数字。校验位将自动计算
zh_hant: 請輸入12位或13位數字。檢查碼將自動計算

# barcode_form.footer.pdf417
source: PDF417 codes support text, numbers, and special characters
ar: رموز PDF417 تدعم النصوص والأرقام والأحرف الخاصة
da: PDF417-koder understøtter tekst, tal og specialtegn
de: PDF417-Codes unterstützen Text, Zahlen und Sonderzeichen
es: Los códigos PDF417 admiten texto, números y caracteres especiales
fi: PDF417-koodit tukevat tekstiä, numeroita ja erikoismerkkejä
fr: Les codes PDF417 prennent en charge le texte, les chiffres et les caractères spéciaux
hi: PDF417 कोड टेक्स्ट, संख्याएं और विशेष अक्षर सपोर्ट करते हैं
id: Kode PDF417 mendukung teks, angka, dan karakter khusus
it: I codici PDF417 supportano testo, numeri e caratteri speciali
ja: PDF417コードはテキスト、数字、特殊文字に対応しています
ko: PDF417 코드는 텍스트, 숫자 및 특수 문자를 지원합니다
ms: Kod PDF417 menyokong teks, nombor dan aksara khas
nb: PDF417-koder støtter tekst, tall og spesialtegn
nl: PDF417-codes ondersteunen tekst, cijfers en speciale tekens
pl: Kody PDF417 obsługują tekst, cyfry i znaki specjalne
pt_br: Os códigos PDF417 suportam texto, números e caracteres especiais
ru: Коды PDF417 поддерживают текст, цифры и специальные символы
sv: PDF417-koder stöder text, siffror och specialtecken
th: PDF417 โค้ดรองรับข้อความ ตัวเลข และอักขระพิเศษ
tr: PDF417 kodları metin, sayı ve özel karakterleri destekler
uk: Коди PDF417 підтримують текст, цифри та спеціальні символи
uz: PDF417 kodlari matn, raqamlar va maxsus belgilarni qo'llab-quvvatlaydi
vi: Mã PDF417 hỗ trợ văn bản, số và ký tự đặc biệt
zh_hans: PDF417码支持文本、数字和特殊字符
zh_hant: PDF417碼支援文字、數字和特殊字元

# barcode_form.footer.upca
source: Enter 11 or 12 digits. Check digit will be calculated automatically
ar: أدخل 11 أو 12 رقماً. سيتم حساب رقم التحقق تلقائياً
da: Indtast 11 eller 12 cifre. Kontrolcifferet beregnes automatisk
de: Gib 11 oder 12 Ziffern ein. Die Prüfziffer wird automatisch berechnet
es: Ingresa 11 o 12 dígitos. El dígito de control se calculará automáticamente
fi: Syötä 11 tai 12 numeroa. Tarkistusnumero lasketaan automaattisesti
fr: Saisissez 11 ou 12 chiffres. Le chiffre de contrôle sera calculé automatiquement
hi: 11 या 12 अंक दर्ज करें। चेक डिजिट स्वचालित रूप से गणना होगी
id: Masukkan 11 atau 12 digit. Digit cek akan dihitung otomatis
it: Inserisci 11 o 12 cifre. La cifra di controllo verrà calcolata automaticamente
ja: 11桁または12桁を入力してください。チェックディジットは自動計算されます
ko: 11자리 또는 12자리를 입력하세요. 체크 디지트가 자동으로 계산됩니다
ms: Masukkan 11 atau 12 digit. Digit semak akan dikira secara automatik
nb: Skriv inn 11 eller 12 sifre. Kontrollsifferet beregnes automatisk
nl: Voer 11 of 12 cijfers in. Het controlecijfer wordt automatisch berekend
pl: Wpisz 11 lub 12 cyfr. Cyfra kontrolna zostanie obliczona automatycznie
pt_br: Digite 11 ou 12 dígitos. O dígito verificador será calculado automaticamente
ru: Введите 11 или 12 цифр. Контрольная цифра будет рассчитана автоматически
sv: Ange 11 eller 12 siffror. Kontrollsiffran beräknas automatiskt
th: กรอก 11 หรือ 12 หลัก ตัวเลขตรวจสอบจะคำนวณโดยอัตโนมัติ
tr: 11 veya 12 rakam girin. Kontrol basamağı otomatik hesaplanır
uk: Введіть 11 або 12 цифр. Контрольна цифра буде розрахована автоматично
uz: 11 yoki 12 ta raqam kiriting. Tekshiruv raqami avtomatik hisoblanadi
vi: Nhập 11 hoặc 12 chữ số. Số kiểm tra sẽ được tính tự động
zh_hans: 请输入11位或12位数字。校验位将自动计算
zh_hant: 請輸入11位或12位數字。檢查碼將自動計算

# barcode_form.placeholder.enter_8_digits
source: Enter 8 digits
ar: أدخل 8 أرقام
da: Indtast 8 cifre
de: 8 Ziffern eingeben
es: Ingresa 8 dígitos
fi: Syötä 8 numeroa
fr: Saisissez 8 chiffres
hi: 8 अंक दर्ज करें
id: Masukkan 8 digit
it: Inserisci 8 cifre
ja: 8桁を入力
ko: 8자리 입력
ms: Masukkan 8 digit
nb: Skriv inn 8 sifre
nl: Voer 8 cijfers in
pl: Wpisz 8 cyfr
pt_br: Digite 8 dígitos
ru: Введите 8 цифр
sv: Ange 8 siffror
th: กรอก 8 หลัก
tr: 8 rakam girin
uk: Введіть 8 цифр
uz: 8 ta raqam kiriting
vi: Nhập 8 chữ số
zh_hans: 输入8位数字
zh_hant: 輸入8位數字

# barcode_form.placeholder.enter_12_digits
source: Enter 12 digits
ar: أدخل 12 رقماً
da: Indtast 12 cifre
de: 12 Ziffern eingeben
es: Ingresa 12 dígitos
fi: Syötä 12 numeroa
fr: Saisissez 12 chiffres
hi: 12 अंक दर्ज करें
id: Masukkan 12 digit
it: Inserisci 12 cifre
ja: 12桁を入力
ko: 12자리 입력
ms: Masukkan 12 digit
nb: Skriv inn 12 sifre
nl: Voer 12 cijfers in
pl: Wpisz 12 cyfr
pt_br: Digite 12 dígitos
ru: Введите 12 цифр
sv: Ange 12 siffror
th: กรอก 12 หลัก
tr: 12 rakam girin
uk: Введіть 12 цифр
uz: 12 ta raqam kiriting
vi: Nhập 12 chữ số
zh_hans: 输入12位数字
zh_hant: 輸入12位數字

# barcode_form.placeholder.enter_13_digits
source: Enter 13 digits
ar: أدخل 13 رقماً
da: Indtast 13 cifre
de: 13 Ziffern eingeben
es: Ingresa 13 dígitos
fi: Syötä 13 numeroa
fr: Saisissez 13 chiffres
hi: 13 अंक दर्ज करें
id: Masukkan 13 digit
it: Inserisci 13 cifre
ja: 13桁を入力
ko: 13자리 입력
ms: Masukkan 13 digit
nb: Skriv inn 13 sifre
nl: Voer 13 cijfers in
pl: Wpisz 13 cyfr
pt_br: Digite 13 dígitos
ru: Введите 13 цифр
sv: Ange 13 siffror
th: กรอก 13 หลัก
tr: 13 rakam girin
uk: Введіть 13 цифр
uz: 13 ta raqam kiriting
vi: Nhập 13 chữ số
zh_hans: 输入13位数字
zh_hant: 輸入13位數字

# barcode_form.placeholder.text_or_numbers
source: Enter text or numbers
ar: أدخل نصاً أو أرقاماً
da: Indtast tekst eller tal
de: Text oder Zahlen eingeben
es: Ingresa texto o números
fi: Syötä tekstiä tai numeroita
fr: Saisissez du texte ou des chiffres
hi: टेक्स्ट या संख्याएं दर्ज करें
id: Masukkan teks atau angka
it: Inserisci testo o numeri
ja: テキストまたは数字を入力
ko: 텍스트 또는 숫자 입력
ms: Masukkan teks atau nombor
nb: Skriv inn tekst eller tall
nl: Voer tekst of cijfers in
pl: Wpisz tekst lub cyfry
pt_br: Digite texto ou números
ru: Введите текст или цифры
sv: Ange text eller siffror
th: กรอกข้อความหรือตัวเลข
tr: Metin veya sayı girin
uk: Введіть текст або цифри
uz: Matn yoki raqamlar kiriting
vi: Nhập văn bản hoặc số
zh_hans: 输入文本或数字
zh_hant: 輸入文字或數字

# barcode_type.aztec.description
source: 2D matrix barcode
ar: باركود مصفوفة ثنائي الأبعاد
da: 2D-matrix stregkode
es: Código de barras matricial 2D
fi: 2D-matriisiviivakoodi
fr: Code-barres matriciel 2D
hi: 2D मैट्रिक्स बारकोड
id: Barcode matriks 2D
it: Codice a barre matriciale 2D
ja: 2Dマトリクスバーコード
ko: 2D 매트릭스 바코드
ms: Kod bar matriks 2D
nb: 2D-matrise strekkode
nl: 2D-matrixcode
pl: Kod matrycowy 2D
pt_br: Código de barras matricial 2D
ru: 2D матричный штрих-код
sv: 2D-matriskod
th: บาร์โค้ดเมทริกซ์ 2 มิติ
tr: 2B matris barkod
uk: 2D матричний штрих-код
uz: 2D matritsali shtrix-kod
vi: Mã vạch ma trận 2D
zh_hans: 二维矩阵条码
zh_hant: 2D矩陣條碼

# barcode_type.aztec.placeholder
source: Enter text or numbers
ar: أدخل نصاً أو أرقاماً
da: Indtast tekst eller tal
de: Text oder Zahlen eingeben
es: Ingresa texto o números
fi: Syötä tekstiä tai numeroita
fr: Saisissez du texte ou des chiffres
hi: टेक्स्ट या संख्याएं दर्ज करें
id: Masukkan teks atau angka
it: Inserisci testo o numeri
ja: テキストまたは数字を入力
ko: 텍스트 또는 숫자 입력
ms: Masukkan teks atau nombor
nb: Skriv inn tekst eller tall
nl: Voer tekst of cijfers in
pl: Wpisz tekst lub cyfry
pt_br: Digite texto ou números
ru: Введите текст или цифры
sv: Ange text eller siffror
th: กรอกข้อความหรือตัวเลข
tr: Metin veya sayı girin
uk: Введіть текст або цифри
uz: Matn yoki raqamlar kiriting
vi: Nhập văn bản hoặc số
zh_hans: 输入文本或数字
zh_hant: 輸入文字或數字

# barcode_type.code39.description
source: Alphanumeric barcode
ar: باركود أبجدي رقمي
da: Alfanumerisk stregkode
de: Alphanumerischer Barcode
es: Código de barras alfanumérico
fi: Aakkosnumeerinen viivakoodi
fr: Code-barres alphanumérique
hi: अल्फ़ान्यूमेरिक बारकोड
id: Barcode alfanumerik
it: Codice a barre alfanumerico
ja: 英数字バーコード
ko: 영숫자 바코드
ms: Kod bar alfanumerik
nb: Alfanumerisk strekkode
nl: Alfanumerieke streepjescode
pl: Kod alfanumeryczny
pt_br: Código de barras alfanumérico
ru: Буквенно-цифровой штрих-код
sv: Alfanumerisk streckkod
th: บาร์โค้ดตัวอักษรและตัวเลข
tr: Alfanümerik barkod
uk: Буквено-цифровий штрих-код
uz: Alfanumerik shtrix-kod
vi: Mã vạch chữ-số
zh_hans: 字母数字条码
zh_hant: 英數字條碼

# barcode_type.code39.placeholder
source: Enter text or numbers
ar: أدخل نصاً أو أرقاماً
da: Indtast tekst eller tal
de: Text oder Zahlen eingeben
es: Ingresa texto o números
fi: Syötä tekstiä tai numeroita
fr: Saisissez du texte ou des chiffres
hi: टेक्स्ट या संख्याएं दर्ज करें
id: Masukkan teks atau angka
it: Inserisci testo o numeri
ja: テキストまたは数字を入力
ko: 텍스트 또는 숫자 입력
ms: Masukkan teks atau nombor
nb: Skriv inn tekst eller tall
nl: Voer tekst of cijfers in
pl: Wpisz tekst lub cyfry
pt_br: Digite texto ou números
ru: Введите текст или цифры
sv: Ange text eller siffror
th: กรอกข้อความหรือตัวเลข
tr: Metin veya sayı girin
uk: Введіть текст або цифри
uz: Matn yoki raqamlar kiriting
vi: Nhập văn bản hoặc số
zh_hans: 输入文本或数字
zh_hant: 輸入文字或數字

# barcode_type.code93.description
source: Compact alphanumeric
ar: أبجدي رقمي مضغوط
da: Kompakt alfanumerisk
de: Kompakter alphanumerischer Code
es: Alfanumérico compacto
fi: Kompakti aakkosnumeerinen
fr: Alphanumérique compact
hi: कॉम्पैक्ट अल्फ़ान्यूमेरिक
id: Alfanumerik ringkas
it: Alfanumerico compatto
ja: コンパクト英数字
ko: 컴팩트 영숫자
ms: Alfanumerik padat
nb: Kompakt alfanumerisk
nl: Compacte alfanumerieke code
pl: Kompaktowy alfanumeryczny
pt_br: Alfanumérico compacto
ru: Компактный буквенно-цифровой
sv: Kompakt alfanumerisk
th: ตัวอักษรและตัวเลขแบบกะทัดรัด
tr: Kompakt alfanümerik
uk: Компактний буквено-цифровий
uz: Ixcham alfanumerik
vi: Chữ-số thu gọn
zh_hans: 紧凑型字母数字
zh_hant: 緊湊型英數字

# barcode_type.code93.placeholder
source: Enter text or numbers
ar: أدخل نصاً أو أرقاماً
da: Indtast tekst eller tal
de: Text oder Zahlen eingeben
es: Ingresa texto o números
fi: Syötä tekstiä tai numeroita
fr: Saisissez du texte ou des chiffres
hi: टेक्स्ट या संख्याएं दर्ज करें
id: Masukkan teks atau angka
it: Inserisci testo o numeri
ja: テキストまたは数字を入力
ko: 텍스트 또는 숫자 입력
ms: Masukkan teks atau nombor
nb: Skriv inn tekst eller tall
nl: Voer tekst of cijfers in
pl: Wpisz tekst lub cyfry
pt_br: Digite texto ou números
ru: Введите текст или цифры
sv: Ange text eller siffror
th: กรอกข้อความหรือตัวเลข
tr: Metin veya sayı girin
uk: Введіть текст або цифри
uz: Matn yoki raqamlar kiriting
vi: Nhập văn bản hoặc số
zh_hans: 输入文本或数字
zh_hant: 輸入文字或數字

# barcode_type.code128.description
source: Alphanumeric barcode
ar: باركود أبجدي رقمي
da: Alfanumerisk stregkode
de: Alphanumerischer Barcode
es: Código de barras alfanumérico
fi: Aakkosnumeerinen viivakoodi
fr: Code-barres alphanumérique
hi: अल्फ़ान्यूमेरिक बारकोड
id: Barcode alfanumerik
it: Codice a barre alfanumerico
ja: 英数字バーコード
ko: 영숫자 바코드
ms: Kod bar alfanumerik
nb: Alfanumerisk strekkode
nl: Alfanumerieke streepjescode
pl: Kod alfanumeryczny
pt_br: Código de barras alfanumérico
ru: Буквенно-цифровой штрих-код
sv: Alfanumerisk streckkod
th: บาร์โค้ดตัวอักษรและตัวเลข
tr: Alfanümerik barkod
uk: Буквено-цифровий штрих-код
uz: Alfanumerik shtrix-kod
vi: Mã vạch chữ-số
zh_hans: 字母数字条码
zh_hant: 英數字條碼

# barcode_type.code128.placeholder
source: Enter text or numbers
ar: أدخل نصاً أو أرقاماً
da: Indtast tekst eller tal
de: Text oder Zahlen eingeben
es: Ingresa texto o números
fi: Syötä tekstiä tai numeroita
fr: Saisissez du texte ou des chiffres
hi: टेक्स्ट या संख्याएं दर्ज करें
id: Masukkan teks atau angka
it: Inserisci testo o numeri
ja: テキストまたは数字を入力
ko: 텍스트 또는 숫자 입력
ms: Masukkan teks atau nombor
nb: Skriv inn tekst eller tall
nl: Voer tekst of cijfers in
pl: Wpisz tekst lub cyfry
pt_br: Digite texto ou números
ru: Введите текст или цифры
sv: Ange text eller siffror
th: กรอกข้อความหรือตัวเลข
tr: Metin veya sayı girin
uk: Введіть текст або цифри
uz: Matn yoki raqamlar kiriting
vi: Nhập văn bản hoặc số
zh_hans: 输入文本或数字
zh_hant: 輸入文字或數字

# barcode_type.ean8.description
source: 8-digit product code
ar: رمز منتج من 8 أرقام
da: 8-cifret produktkode
de: 8-stelliger Produktcode
es: Código de producto de 8 dígitos
fi: 8-numeroinen tuotekoodi
fr: Code produit à 8 chiffres
hi: 8 अंकों का उत्पाद कोड
id: Kode produk 8 digit
it: Codice prodotto a 8 cifre
ja: 8桁の商品コード
ko: 8자리 상품 코드
ms: Kod produk 8 digit
nb: 8-sifret produktkode
nl: 8-cijferige productcode
pl: 8-cyfrowy kod produktu
pt_br: Código de produto de 8 dígitos
ru: 8-значный код товара
sv: 8-siffrig produktkod
th: รหัสสินค้า 8 หลัก
tr: 8 haneli ürün kodu
uk: 8-значний код товару
uz: 8 raqamli mahsulot kodi
vi: Mã sản phẩm 8 chữ số
zh_hans: 8位商品码
zh_hant: 8位商品碼

# barcode_type.ean8.placeholder
source: Enter 8 digits
ar: أدخل 8 أرقام
da: Indtast 8 cifre
de: 8 Ziffern eingeben
es: Ingresa 8 dígitos
fi: Syötä 8 numeroa
fr: Saisissez 8 chiffres
hi: 8 अंक दर्ज करें
id: Masukkan 8 digit
it: Inserisci 8 cifre
ja: 8桁を入力
ko: 8자리 입력
ms: Masukkan 8 digit
nb: Skriv inn 8 sifre
nl: Voer 8 cijfers in
pl: Wpisz 8 cyfr
pt_br: Digite 8 dígitos
ru: Введите 8 цифр
sv: Ange 8 siffror
th: กรอก 8 หลัก
tr: 8 rakam girin
uk: Введіть 8 цифр
uz: 8 ta raqam kiriting
vi: Nhập 8 chữ số
zh_hans: 输入8位数字
zh_hant: 輸入8位數字
